Revit 2027 API
ScheduleFilter.SetValue(Double) Method
 Set the filter value to a double.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValue(
	double value
)
Public Sub SetValue (
	value As Double
)
public:
void SetValue(
	double value
)
member SetValue :
        value : float -> unit
Parameters
value Double
 The filter value.
See Also
Reference
ScheduleFilter Class
SetValue Overload
Autodesk.Revit.DB Namespace